#pragma once
#include <QSharedPointer>
#include <QWeakPointer>
#include <QEnableSharedFromThis>
///--------------------------------------------------------------------------------------

namespace DataSource
{
	///--------------------------------------------------------------------------------------




	///--------------------------------------------------------------------------------------
	class ADataSource;
	///--------------------------------------------------------------------------------------





	 ///=====================================================================================
	///
	/// Интерфес для передачи данных между источником и клиентом
	/// 
	/// 
	///--------------------------------------------------------------------------------------
	class AAdapter
		: 
			public QEnableSharedFromThis<AAdapter>
	{


	public:
		AAdapter();
		

		virtual ~AAdapter();


		void connectDataSource(const QSharedPointer<ADataSource> &dataSource);
		void disconnectDataSource(); //отключаем источник данных

	private:

		QWeakPointer<ADataSource> mDataSource;


	};
	///--------------------------------------------------------------------------------------




		
	///--------------------------------------------------------------------------------------
	typedef QSharedPointer<AAdapter> PAdapter;
	///--------------------------------------------------------------------------------------



//-------------------------------------------------------------------------------------------
}//namespace

