#pragma once
#include <QObject>
#include <QSharedPointer>
#include <QString>
#include <QWidget>

#include "MarkingContainer.h"
///--------------------------------------------------------------------------------------

namespace Chart
{
	///--------------------------------------------------------------------------------------









	 ///=====================================================================================
	///
	/// ОДин график
	/// 
	/// 
	///--------------------------------------------------------------------------------------
	class AChart
			: 
				public QObject
	{
		Q_OBJECT

	public:
		AChart();


		virtual ~AChart();

		QString		title() const;		//возвратим название диаграмы
		QWidget*	createWidget();		//создание представление данных

		void		clear();			//очистка всей диаграммы, уберание всех зависемостей

		void		setMarking(const Marking::PMarkingContainer &marking); //установка действующих закладок

	private:

		int mNumber; //тестовый номер диаграмы

		Marking::PMarkingContainer mMarking; //закладки

	private slots:

		//void slot_change(const AMarking* marking); //изменение данных
		void slot_destroyedWidget(QObject *obj); //удаление виджета
	};
	///--------------------------------------------------------------------------------------




		
	///--------------------------------------------------------------------------------------
	typedef QSharedPointer<AChart> PChart;
	///--------------------------------------------------------------------------------------



//-------------------------------------------------------------------------------------------
}//namespace

