#pragma once
#include <QString>
#include <QTabWidget>

#include "Chart.h"
#include "ChartContainer.h"
///--------------------------------------------------------------------------------------

namespace Chart
{
	///--------------------------------------------------------------------------------------









	 ///=====================================================================================
	///
	/// Утилита для синхронизации с табами
	/// 
	/// 
	///--------------------------------------------------------------------------------------
	class AChartTabs
	{


	public:
		AChartTabs(const PChartContainer &chart);


		virtual ~AChartTabs();

		void syncWidget(QTabWidget *tabs); //синхронизация диаграм с табами

		bool isContaint(const PChart &chartCheck, const QTabWidget *tabs) const; //проверка, есть данный диаграма в вкладках таба

	private:

		PChartContainer mChart; //список диаграм



	};
	///--------------------------------------------------------------------------------------




	

//-------------------------------------------------------------------------------------------
}//namespace

