#pragma once
#include <QObject>
#include <QSharedPointer>
#include <QString>
#include <QWidget>
///--------------------------------------------------------------------------------------

namespace Chart
{
	///--------------------------------------------------------------------------------------









	 ///=====================================================================================
	///
	/// ОДин график
	/// 
	/// 
	///--------------------------------------------------------------------------------------
	class AChart
			: 
				public QObject
	{
		Q_OBJECT

	public:
		AChart();


		virtual ~AChart();

		QString title() const; //возвратим название диаграмы

		QWidget* createWidget(); //создание представление данных


	private:

		int mNumber; //тестовый номер диаграмы

	private slots:

		//void slot_change(const AMarking* marking); //изменение данных
	};
	///--------------------------------------------------------------------------------------




		
	///--------------------------------------------------------------------------------------
	typedef QSharedPointer<AChart> PChart;
	///--------------------------------------------------------------------------------------



//-------------------------------------------------------------------------------------------
}//namespace

