#pragma once
#include <QObject>
#include <QSharedPointer>
#include <QString>
///--------------------------------------------------------------------------------------

namespace DataSource
{
	///--------------------------------------------------------------------------------------









	 ///=====================================================================================
	///
	/// Источник данных
	/// 
	/// 
	///--------------------------------------------------------------------------------------
	class ADataSource
			: 
				public QObject
	{
		Q_OBJECT

	public:
		ADataSource();
		

		virtual ~ADataSource();


		virtual QString title() const	= 0; //возвратим имя источника данных
		virtual void	show()			= 0; //покажем диалог информации по источнику данных

	private:




	public slots:

		void slot_show(); //покажем диалог информации по источнику данных
	};
	///--------------------------------------------------------------------------------------




		
	///--------------------------------------------------------------------------------------
	typedef QSharedPointer<ADataSource> PDataSource;
	///--------------------------------------------------------------------------------------



//-------------------------------------------------------------------------------------------
}//namespace

