#include "DSComPort.h"
#include <QVariant>
#include <QTime>
#include <QDateTime>

#include "DSComPortDialog.h"
///--------------------------------------------------------------------------------------



///--------------------------------------------------------------------------------------
using namespace DataSource;
///--------------------------------------------------------------------------------------





///--------------------------------------------------------------------------------------
int gNumberComPort = 0;
///--------------------------------------------------------------------------------------







 ///=====================================================================================
///
/// Constructor
/// 
/// 
///--------------------------------------------------------------------------------------
AComPort :: AComPort ()
	:
	mBeginMs(0),
	mLastTime(0)
{
	gNumberComPort++;
	mNumber = gNumberComPort;

	mSerial = new QSerialPort(this);

	connect(mSerial, SIGNAL(readyRead()), this, SLOT(slot_readDataNativ()));
	connect(mSerial, SIGNAL(error(QSerialPort::SerialPortError)), this, SLOT(slot_errorNativ(QSerialPort::SerialPortError)));

}
///--------------------------------------------------------------------------------------







 ///=====================================================================================
///
/// Destructor
/// 
/// 
///--------------------------------------------------------------------------------------
AComPort :: ~AComPort ()
{
	clear();

	/*
	if (!mPort.isNull())
	{
		mPort->close();
	}
	*/

	if (!mWidget.isNull())
	{
		mWidget->close();
	}

	delete mSerial;
}
///--------------------------------------------------------------------------------------










 ///=====================================================================================
///
/// возвратим имя источника данных
/// 
/// 
///--------------------------------------------------------------------------------------
QString AComPort :: title() const
{
	QString name = "NONE";
	if (!mPortInfo.isNull())
	{
		name = mPortInfo.portName();
	}
	return "Com port - " + QString::number(mNumber) + " [" + name + "]";
}
///--------------------------------------------------------------------------------------








 ///=====================================================================================
///
/// покажем диалог информации по источнику данных
/// 
/// 
///--------------------------------------------------------------------------------------
void AComPort :: show()
{
	if (mWidget.isNull())
	{
		mWidget = PComPortDialog::create();
	}

	auto _this = qSharedPointerCast<AComPort>(sharedFromThis());
	mWidget->show(_this);
}
///--------------------------------------------------------------------------------------







 ///=====================================================================================
///
/// ктоо подсоеденился
/// 
/// 
///--------------------------------------------------------------------------------------
void AComPort :: onConnect()
{
	refreshWidget();
}
///--------------------------------------------------------------------------------------





 ///=====================================================================================
///
/// ктото отсоединлся
/// 
/// 
///--------------------------------------------------------------------------------------
void AComPort :: onDisconnect()
{
	refreshWidget();
}
///--------------------------------------------------------------------------------------








 ///=====================================================================================
///
/// открытие данных
/// 
/// 
///--------------------------------------------------------------------------------------
bool AComPort :: onOpen()
{
	mLastError.clear();

	/*
	if (mPort.isNull() || mPort->isActive())
	{
		if (!mPort.isNull())
		{
			mPort->close();
		}

		mPort = Utils::PSerialPort::create();
		connect(mPort.data(), &Utils::ASerialPort::signal_readLine, this, &AComPort::slot_readData);
		connect(mPort.data(), &Utils::ASerialPort::signal_error, this, &AComPort::slot_error);
	}
	*/

	if (mSerial->isOpen())
	{
        mSerial->close();
	}
	mSerial->setPort(mPortInfo);
	bool ok = mSerial->open(QIODevice::ReadWrite);



	mBeginMs = QDateTime::currentMSecsSinceEpoch();
	mLastTime = 0;

	//mPort->open(mPortInfo);
	refreshWidget();
	return ok;
}
///--------------------------------------------------------------------------------------








 ///=====================================================================================
///
/// закрытие данных
/// 
/// 
///--------------------------------------------------------------------------------------
bool AComPort :: onClose()
{
	/*
	if (!mPort.isNull())
	{
		mPort->close();
	}
	*/
	if (mSerial->isOpen())
	{
        mSerial->close();
	}


	mLastTime = 0;
	refreshWidget();
	return true;
}
///--------------------------------------------------------------------------------------








 ///=====================================================================================
///
/// обновление таймера
/// 
/// 
///--------------------------------------------------------------------------------------
void AComPort :: slot_readData(QString text)
{
	bool ok = false;
	const int val = text.toInt(&ok);
	if (!ok)
	{
		return;
	}

	if (val < settings::min || val > settings::max)
	{
		return;
	}

	const int timeMs = QDateTime::currentMSecsSinceEpoch() - mBeginMs;
	mLastTime = timeMs;

	QList<int> data;
	data.append(timeMs);
	data.append(val);
	streamData->command_dataSend(QVariant::fromValue<QList<int>>(data));

}
///--------------------------------------------------------------------------------------






 ///=====================================================================================
///
/// чтение данных
/// 
/// 
///--------------------------------------------------------------------------------------
void AComPort :: slot_readDataNativ()
{
	QByteArray data = mSerial->readAll();
	QString dataCmd = QString::fromLocal8Bit(data);
	QStringList list = dataCmd.split("\r\n");

	if (!list.empty())
	{
		slot_readData(list[0]);
	}
}
///--------------------------------------------------------------------------------------







 ///=====================================================================================
///
/// ошибка
/// 
/// 
///--------------------------------------------------------------------------------------
void AComPort :: slot_error(QString error)
{
	mLastError.append(error);
	show();
	streamData->command_dataError(error);
		
	refreshWidget();
}
///--------------------------------------------------------------------------------------




 ///=====================================================================================
///
/// ошибка данных
/// 
/// 
///--------------------------------------------------------------------------------------
void AComPort :: slot_errorNativ(QSerialPort::SerialPortError serialPortError)
{
	slot_error(mSerial->errorString());
}
///--------------------------------------------------------------------------------------






 ///=====================================================================================
///
/// последняя ошибка
/// 
/// 
///--------------------------------------------------------------------------------------
QStringList AComPort :: lastError() const
{
	return mLastError;
}
///--------------------------------------------------------------------------------------







 ///=====================================================================================
///
/// возвратим интервал таймера
/// 
/// 
///--------------------------------------------------------------------------------------
QSerialPortInfo AComPort :: portInfo() const
{
	return mPortInfo;
}
///--------------------------------------------------------------------------------------




 ///=====================================================================================
///
/// установим информацию по порту
/// 
/// 
///--------------------------------------------------------------------------------------
void AComPort :: setPortInfo(const QSerialPortInfo &info)
{
	mPortInfo = info;
	refreshWidget();
}
///--------------------------------------------------------------------------------------




 ///=====================================================================================
///
/// возвратим последнее время
/// 
/// 
///--------------------------------------------------------------------------------------
int AComPort :: lastTimeMS() const
{
	return mLastTime;
}
///--------------------------------------------------------------------------------------








 ///=====================================================================================
///
/// обновим виджет
/// 
/// 
///--------------------------------------------------------------------------------------
void AComPort :: refreshWidget()
{
	if (!mWidget.isNull())
	{
		mWidget->refresh();
	}
}