#pragma once
#include <QSharedPointer>
#include <QTimer>
#include "DataSource.h"
///--------------------------------------------------------------------------------------

namespace DataSource
{
	///--------------------------------------------------------------------------------------








	///--------------------------------------------------------------------------------------
	class AManualControlDialog;
	///--------------------------------------------------------------------------------------





	 ///=====================================================================================
	///
	/// Источник данных
	/// 
	/// 
	///--------------------------------------------------------------------------------------
	class AManualControl
			: 
				public ADataSource
	{


	public:
		AManualControl();
		

		virtual ~AManualControl();


		QString		title() const override; //возвратим имя источника данных
		void		show() override; //покажем диалог информации по источнику данных

		int			interval() const; //возвратим интервал таймера
		void		setInterval(const int value); //установим интервал таймера

		int			lastTimeMS() const; //возвратим последнее время

		int			data() const; //возвратим данные
		void		setData(const int value); //утсновим значение

	protected:
		
		void onOpen() override;		//открытие данных
		void onClose() override;	//закрытие данных
		void onConnect() override;	//ктоо подсоеденился
		void onDisconnect() override;//ктото отсоединлся
		
	private:

		int		mNumber; //номер генератора

		int		mInterval;	//скорость работы таймера
		int		mLastTime;	//последие значения времени в милисикундах
		int		mData;		//данные для передачи



		QSharedPointer<AManualControlDialog> mWidget;


		void refreshWidget();//обновим виджет
	};
	///--------------------------------------------------------------------------------------




		
	///--------------------------------------------------------------------------------------
	typedef QSharedPointer<AManualControl> PManualControl;
	///--------------------------------------------------------------------------------------



//-------------------------------------------------------------------------------------------
}//namespace

