#pragma once
#include <QSharedPointer>
#include "DataSource.h"
///--------------------------------------------------------------------------------------

namespace DataSource
{
	///--------------------------------------------------------------------------------------









	 ///=====================================================================================
	///
	/// Источник данных
	/// 
	/// 
	///--------------------------------------------------------------------------------------
	class ARandomGenerator
			: 
				public ADataSource
	{


	public:
		ARandomGenerator();
		

		virtual ~ARandomGenerator();


		QString	title() const override; //возвратим имя источника данных
		void	show() override; //покажем диалог информации по источнику данных


	private:

		int mNumber; //номер генератора


	};
	///--------------------------------------------------------------------------------------




		
	///--------------------------------------------------------------------------------------
	typedef QSharedPointer<ARandomGenerator> PRandomGenerator;
	///--------------------------------------------------------------------------------------



//-------------------------------------------------------------------------------------------
}//namespace

