#pragma once
#include <QObject>
#include <QSharedPointer>
#include <QString>
///--------------------------------------------------------------------------------------

namespace Marking
{
	///--------------------------------------------------------------------------------------









	 ///=====================================================================================
	///
	/// Одна метка
	/// 
	/// 
	///--------------------------------------------------------------------------------------
	class AMarking
			: 
				public QObject
	{
		Q_OBJECT

	public:
		AMarking();
		AMarking(const int value, const QString &description);

		virtual ~AMarking();


		int value() const;				//значение метки
		QString description() const;	//пояснение метки


	private:

		int mValue;
		QString mDescription;


	private slots:

		//void slot_change(const AMarking* marking); //изменение данных
	};
	///--------------------------------------------------------------------------------------




		
	///--------------------------------------------------------------------------------------
	typedef QSharedPointer<AMarking> PMarking;
	///--------------------------------------------------------------------------------------



//-------------------------------------------------------------------------------------------
}//namespace

